Gihub supports Mermaid
